 
 
# #შექმენით პროგრამა, რომელიც კაფეს ვირტუალური სალაროს როლს შეასრულებს. პროგრამამ მომხმარებელს უნდა გამოჰკითხოს შეკვეთის დეტალები, გამოითვალოს ფასდაკლებები, დაამატოს მომსახურების საკომისიო და ეკრანზე დაბეჭდოს საბოლოო ქვითარი.
# $სავალდებულო მოთხოვნები:
# #მონაცემების მიღება:
# ჰკითხეთ მომხმარებელს სახელი.
# აჩვენეთ მენიუ და ჰკითხეთ, რისი შეკვეთა სურს (ყავა, ჩაი თუ წვენი).
# ჰკითხეთ სასმელების რაოდენობა.
# ფასები:
# ყავა — 15 ლარი
# ჩაი — 9 ლარი
# წვენი — 12 ლარი
# ფასდაკლების ლოგიკა (if-elif-else):
# ჰკითხეთ მომხმარებელს, არის თუ არა სტუდენტი (დიახ / არა). სტუდენტებს ერგებათ 10%-იანი ფასდაკლება.
# თუ შეკვეთილი სასმელების რაოდენობა 5-ზე მეტია, დაემატოს დამატებითი 5%-იანი ფასდაკლება.
# მომსახურების საკომისიო:
# ფასდაკლების გამოყენების შემდეგ ჯამურ თანხას დაემატოს 10%-იანი მომსახურების საკომისიო.
# ქვითრის დაბეჭდვა:
# გამოიტანეთ: მომხმარებლის სახელი, საწყისი თანხა, ფასდაკლების ოდენობა, მომსახურების საკომისიო და საბოლოო გადასახდელი თანხა.


 

def sum_mix(arr):
    total = 0
    for x in arr:     
        total = total + int(x)
    return total    
    
 
print(sum_mix([1,'36', 67]))
print(sum_mix([5, '5', 10]))





















