


birds  = ["Pigeon",  45, "flamingo", "pinguin", "Thrush",  68, "Ostrich", "Goose"]



things = ["pencil", 35, "pen",  56.45, True, "eraser", 24]
print(things[2])
print(things[4])
print(things[6])




#სია არის მონაცემთა სტრუქტურა, რომელიც საშუალებას გვაძლევს ერთ ცვლადში შევინახოთ ბევრი ელემენტი ერთად. 




# როგორ იქმნება სია Python-ში:
# სია იქმნება კვადრატული ფრჩხილების [] გამოყენებით.
# ელემენტები ერთმანეთისგან გამოიყოფა მძიმით (,).

 

# სიაში შეიძლება იყოს ნებისმიერი ტიპის მონაცემი (string, integer, flout და ballon)
 

 
#ინდექსი არის სიაში არსებული ელემენტის რიგითი ნომერი (მისამართი). მისი საშუალებით ვეუბნებით კომპიუტერს, თუ მერამდენე ელემენტის წაკითხვა ან შეცვლა გვინდა.



#ჩვეულებრივი ცვლადი ჰგავს პატარა ყუთს, სადაც ერთჯერ  მხოლოდ ერთი ნივთის (ერთი მნიშვნელობის) ჩადება შეგიძლიათ. თუ ახალ ნივთს ჩადებთ, ძველი წაიშლება.

#სია (List) არის დიდი ყუთი, რომელსაც შიგნით ბევრი პატარა უჯრა აქვს (ინდექსირებული უჯრები). მასში შეგიძლიათ ერთდროულად ბევრი ნივთი შეინახოთ 












