



#upper() - ადიდებს სიტყვას ან წინადადებას

#lower() - პირიქით სიყყვას ან წინაადადებას აპატარავებს

#capitalize() - პირველ ასოს ხდის დიდს დანარჩენს პატარას

#.find() - როდესაც სიტყვაში ან წინადადებაში გვინდა ასოს მოძებნა

#.count() - როდესაც გვინდა დავითვალოთ რამდენჯერ გხვდება ერთი ასო  სიტყვაში

#.endswith() - ამოწმებს თუ მთავრდება იმ ასოთი ან ციფრით რომელიც დავწერეთ სიტყვის ბოლოს

#startswith() - ამოწმებს თუ იწყება  იმ ასოთი ან ციფრით რომელიც დავწერეთ სიტყვის დასაწყისში  

#len() - სიტყვას ითვლის სიგრძეში რამდენი ასოა დაწერილი  





