 


#.upper()- არის როდესაც სიტყვა დაწერილია პატარა ასოებით და გვინდა რომ გავხადოთ დიდი ასოებით დაწერილი 

#.lower()- პირიქით, არის როდესაც სიტყვა დაწერილია დიდი ასოებით და გვინდა რომ გავხადოთ პატარა ასოებით დაწერილი  

#.capitalize()-capitalize() – ეს მეთოდი აიღებს  სტრინგს და მისი ყველაზე პირველი ასოს აკეთებს დიდს (Capital), ხოლო ყველა დანარჩენ ასოს აქცევს პატარად 
 
#.count()- არის როდესაც სიტყვაში გვინდა დავთვალოთ რამდენი ასოა მაგალითად    

#.find()- არის როდესაც სიტყვაში გვინდა მოვძებნოთ ერთ-ერთი ასო 

#.startswith()- არის როდესაც გვინდა ვნახოთ სიტყვა რითი იწყება  

#.endswith()- არის როდესაც გვინდა ვნახოთ სიტყვა რითი მთავრდება  

#len()- ითვლის სიტყვაში ასოებს
 

 
 
sentence = input("შემოიტანეთ ნებისმიერი წინადადება: ") 

 
sentence.lower()

 
print(sentence.lower())


email = input("შემოატანინეთ ელფოსტის მისამართი: ")

email.endswith('@')
 
print(email.upper()) 


book = input("შემოატანინეთ წიგნის დასახელება: ")

print(book.upper())

 

 
sentence = input("შემოიტანეთ წინადადება: ")

 
char = input("შემოიტანეთ საძიებო სიმბოლო: ")

 
count_result = sentence.count(char)

 
print("ეს სიმბოლო წინადადებაში გვხვდება:", count_result, "-ჯერ") 


 
word = input("შემოიტანეთ სიტყვა: ")

 
if word.isupper():
    print("სიტყვა უკვე დიდია!")
else:
     
    upper_word = word.upper()
    print("გადაკეთებული სიტყვა:", upper_word)
