 # Sequences - თანმიმდევრობა. ამ პრინციპის მთავარი იდეა ისაა რომ ყველაფერი ხდება თანმიმდევრობით, მაგალითად როგორც კოდის გაშვება და ასევე შედეგის გამოტანა

# Iteration - გამეორება. ამ პრინციპის მთავარი იდეა ისაა რომ მარტივად შევძლოთ ერთი და იგივე სასრუველი კოდის, მნიშვნელობის განმეორება იმისთვის რომ მივიღოთ შესაბამისი შედეგი.

# Selection - არჩევა. ამ პრინციპის მთავარი იდეა ისაა რომ ჩვენი პროგრამა რაიმე მნიშნელობაზე დაყრდნობით აკეთებს არჩევანს თუ რა შედეგი უნდა გამოვიდეს მაგალითად მომხმარებლის ეკრანზე.

 

#range() ფუნქციას გადაეცემა რიცხვები, რომლებიც განსაზღვრავენ დიაპაზონს.
# მას შეიძლება გადაეცეს 1, 2 ან 3 არგუმენტი (პარამეტრი):
#
# 1. range(stop) -> მაგ: range(5) ქმნის მიმდევრობას: 0, 1, 2, 3, 4 (სტარტი 0-ია, 5 არ შედის).
# 2. range(start, stop) -> მაგ: range(1, 5) ქმნის მიმდევრობას: 1, 2, 3, 4.
# 3. range(start, stop, step) -> მაგ: range(1, 10, 2) ნაბიჯია 2, მივიღებთ: 1, 3, 5, 7, 9.



# როგორ მუშაობს for loop range-თან თანხვედრაში?
# range() ამზადებს რიცხვების "მატარებელს" (მიმდევრობას), ხოლო for ციკლს მოჰყავს
# ეს მატარებელი მოძრაობაში. ციკლის ყოველ ბრუნზე, დროებით ცვლადს (მაგალითად i-ს) 
# ენიჭება range-ის მორიგი რიცხვი, სანამ მიმდევრობა ბოლომდე არ ამოიწურება.



# for loop (ციკლი) არის კონსტრუქცია, რომელიც საშუალებას გვაძლევს კოდის გარკვეული
# ბლოკი გავამეოროთ რამდენჯერმე, ხელით მრავალჯერადი წერის გარეშე.

# ის გვეხმარება იმაში, რომ:
# ა) ავირიდოთ თავიდან ერთი და იმავე კოდის კოპირება (Don't Repeat Yourself).
# ბ) შევამციროთ შეცდომების დაშვების შანსი კოდის წერისას.
# გ) კოდი გავხადოთ ბევრად უფრო მოკლე, სუფთა და მარტივი წასაკითხი.
# დ) მარტივად გადავუაროთ მონაცემთა კოლექციებს (მაგალითად, სიებს ან სტრიქონებს).




print(True and False) # False
print(False and True) # False
print(False and False) # False
print(False or False) # False 
  

print(True or False) # True
print(False or True) # True
print(True and True) # True
print(True or True) # True

 

print( 56 > 34) #true

print( 35 >= 21) #true

print( 48 < 98) #true

print( 46 <= 49 ) #true

print( 37 == 37 ) #true 

 
print(89 > 378 ) # false 
 
print( 59 <  46) # false

print( 23 <=  18 ) # false

print(89 >=98 ) # false

print( 48 == 39) # false


 

for i in range(10 ): 
  print( "bmw m5"  )


for i in range(100):
  print("dolidze")


for i in range(46):
  print("orange")


for i in range(32):
  print("G")
