 # 1) კომენტარების ახსენით თუ რაარის print() და რაში ვიყენებთ მას

# 2)კომენტარების  ახსენით თუ რაარის ტერმინალი და რაში ვიყენებთ მას

# 3)კომენტარების  ახსენით თუ რა მონაცემტა ტიპები გვაქვს პითონში

# 4)კომენტარების print() ის მეშვეობით დაპრინეთ თქვენი სახელი, გვარი, და ასაკი

# 5)კომენტარების  ახსენით თუ რაარის ცვლადი და რაში ვიყენებთ მას
 
# 6)კომენტარების შექმენით 3 ცვლადი და მატში შეინახეთ მნიშვნელობები

# 7)კომენტარების  print() ის გამოყენებით დაბეჭდეთ 3 integer, 3 strging, 3 float მნიშვნელობები


#1) printi - იგივე ბეჭვდა და მას ვიყენებთ როდესაც გვინდა ჩვენი კოდის გამოტანა და რომელსაც ტერმინალში ვხედავთ     


#2) ტერმინალი არის ის ადგილი სადაც ვხედავთ ჩვენს დაწერილ კოდს მას ვიყენებთ იმიტომ რომ ვნახოთ ჩვენი კოდი     

#3) str ing   - ნებისმიერი სიტყვა ბრჩხილებში  float- ნებისმიერი  ათწილადი რიცხვი       integer- ნებისმიერი მთელი რიცხვი  


print("giorgi") 

print("dolidze")

print(15)
 

#5) variables - ცვლადები იგივე ყუთი სადაც ვინახავთ ჩვენს ინფორმაციას იყენება შესანახათ 


name = ("giorgi")  


print(name)

surname =("dolidze")

print(surname) 

age = (15)

print(age)


city =("batumi")

print(city)


print("tower")

print("mouse")

print("animal")

print(278)

print(220)

print(9928) 


print(22.45)  

print(14.46)

print(23.67)

















 