 
#function -  # ფუნქცია არის კოდის წინასწარ გამზადებული, დამოუკიდებელი ბლოკი, 
# რომელიც ასრულებს კონკრეტულ დავალებას.
 
# ფუნქციას აქვს 3 მთავარი თვისება:
# 1. მას აქვს სახელი (რომლითაც მას გამოვიძახებთ ხოლმე).
# 2. მას შეუძლია მიიღოს მონაცემები (არგუმენტები) ფრჩხილებში ().
# 3. ის მუშაობს მხოლოდ მაშინ, როდესაც მას სპეციალურად „გამოვიძახებთ“.

 

#print() არის:
#ჩაშენებული ფუნქცია (Built-in function) – ეს ნიშნავს, რომ ის პითონს 
#თავიდანვე მოჰყვება და ჩვენით მისი შექმნა (დეკლარირება) არ დაგვჭირვებია

 

# არგუმენტი (Argument) არის ის კონკრეტული ინფორმაცია (მონაცემი), 
# რომელსაც ჩვენ გადავცემთ ფუნქციას ფრჩხილებში () მისი გამოძახების დროს. 
#არგუმენტი არის „მასალა“, რომელზეც ეს ინსტრუმენტი მუშაობს

 
#.upper() - ეს არგუმენტი ადიდებს ყველა ასოებს  სიტყვაში ან წინადადებაში    

#.lower() - ეს არგუმენტი პირიქით აპატარავებს ასოებს სიტყვაში ან წინადადებაში     

#.capitalize() - ეს არგუმენტი ადიდებს პირველ ასოს დანარჩენს კი აპატარავებს

 
name = "marona"

print(name.upper())


car = "mercedes"

print(car.upper()) 




bird2 = "FLAMINGO"

 
print(bird2.lower())


pc = 'GAMING'

print(pc.lower())



   

bird = "eagle"

print(bird.capitalize())

car2 = 'ferrari'

print(car2.capitalize())




















